[{"name":"Four Ball Half-Mess","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/fourballhalfmess.gif","siteswap":"4","difficult":" 7","preRequisites":"Half-Mess, Four Ball Mills Mess (optional)","balls":"3","description":[{"tag":"P","texto":" The Four Ball Half-Mess is a variation of the standard Four Ball Mills Mess in which one arm always crosses over the other, creating a simpler and therefore easier pattern. Despite this lower difficulty, the Four Ball Half-Mess is rarely if ever learned before the full Mills Mess, and is often ignored entirely."},{"tag":"P","texto":" As is usually the case with variations, the Four Ball Half-Mess is much easier to learn if you already know the Four Ball Mills Mess. In fact, I was able to transition into a messy version of it without any prior practice. However, this tutorial will assume you have no experience with the Four Ball Mills Mess."},{"tag":"P","texto":" To learn the Four Ball Half-Mess, start with two balls in your dominant hand and one ball in your non-dominant. Cross your dominant hand over your non-dominant, then make a throw across your body from your dominant hand. As you are making that throw, begin to uncross your arms. When your arms become level with each other, make a throw from your non-dominant hand with roughly the same trajectory as the first throw. As the first ball begins to descend toward your now uncrossed dominant hand, you are going to make an overthrow back toward the center of your body, clearing space for you to catch the first ball. You are then going to recross your dominant hand over your non-dominant, catching the second ball with your non-dominant hand and the third ball with your dominant."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/fourballhalfmessthree.gif"},{"tag":"P","texto":" Practice this step until you can make all three throws and catches comfortably. To add in the fourth ball, start with two balls in each hand, and then make the same three throws performed in step one. This time however, you are going to follow up the last throw made from your dominant hand with an identical throw made from your non-dominant hand, clearing space for that hand to catch the second ball. Then catch the rest of the balls, with the fourth ball being caught with your non-dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/fourballhalfmessfour.gif"},{"tag":"P","texto":" Practice these four throws until they are second nature. To run the full Four Ball Half-Mess, simply cross your dominant hand back over your non-dominant hand (as shown in the animation above) and make a throw identical to the very first throw you made, clearing space for you to catch the third ball. This throw marks the beginning of a new cycle, which is then followed by another cycle and then another cycle, and so on, until you are juggling the Four Ball Half-Mess continuously."}]},{"name":"534 Mills Mess","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/534millsmess.gif","siteswap":"534","difficult":" 8","preRequisites":"Four Ball Mills Mess, 534, 531 Mills Mess (optional)","balls":"3","description":[{"tag":"P","texto":" The 534 Mills Mess is a variation of the 534 (or Four Ball Mills Mess) in which the arm motions and throw paths of Mills Mess are applied to the 534 siteswap. Theoretically there are three different ways in which such a combination could be performed, but in practice most jugglers make the \"5\" throw under-the-arm and then go from there. Unsurprisingly it is recommended that you already be comfortable with both the 534 and Four Ball Mills Mess before attempting this trick, though also knowing the 531 Mills Mess would probably help as well."},{"tag":"P","texto":" To begin learning the 534 Mills Mess, start with two balls in your dominant hand and one ball in your non-dominant. Cross your dominant arm underneath your non-dominant arm, and then make a fairly high under-the-arm throw from your dominant hand. Shortly after this throw is made (before the ball reaches its peak), throw the ball in your non-dominant hand as a fairly low Cascade throw toward the center of your body. After that throw is made you will uncross and then begin to recross your arms. As your dominant hand (which is still holding a ball) begins to recross over your non-dominant hand the Cascade throw made by your non-dominant hand should be descending. Make a medium (shorter than the first throw but higher than the second) throw from your dominant hand toward the center of your body, clearing space for your hand to catch the Cascade throw as it finishes recrossing. The high throw, now descending, will be caught under-the-arm by your non-dominant hand, followed by the medium throw which will be caught by your dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/534millsmessthree.gif"},{"tag":"P","texto":" Practice this on both sides. To add in the fourth ball, start with two balls in each hand.&nbsp; Make the same three throws that you did in the previous step then catch the Cascade throw with your dominant hand and recross as usual. Notice that you now have an extra ball in your non-dominant hand. Instead of simply waiting to catch the high throw you will instead make an under-the-arm high throw from your non-dominant hand, clearing space for it to catch the previous high throw. Catch the medium throw with your dominant hand as you normally would, and then also catch the second high throw using your dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/534millsmessfour.gif"},{"tag":"P","texto":" Once again, practice this on both sides. Notice that the first and last throw (the two high throws) are mirror images of each other. To run the full pattern, make a short Cascade throw from your dominant hand before catching the medium throw. Then just repeat the other throws and catches performed in the step above, this time using the opposite hand configuration. Connecting the two sides of the trick can be difficult, but unfortunately there is no way for a tutorial to really help; your body must simply get used to it.&nbsp;"}]},{"name":"Four Ball Shower","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/fourballshower.gif","siteswap":"71","difficult":" 7","preRequisites":"Shower","balls":"3","description":[{"tag":"P","texto":" The Four Ball Shower is just as it sounds: a Shower pattern with four balls. Relative to the Three Ball Shower, this trick has throws that are higher and faster, making the Four Ball Shower significantly more difficult than its little brother."},{"tag":"P","texto":" To learn the Four Ball Shower, it is best to start with two balls in your dominant hand, and one ball in your non-dominant. Make a high throw (a foot or more above your head) from your dominant hand, and then quickly follow with a second high throw from your dominant hand along with a near simultaneous horizontal pass from your non-dominant hand. As the first ball thrown approaches your non-dominant hand, throw your last ball (the one that was passed) along the same path as the previous two. Then catch all the balls. If done right, there should be a brief period of time after the last throw where there are no balls in any of your hands."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/fourballshowerthree.gif"},{"tag":"P","texto":" Practice this until you are able to execute all throws accurately and with consistent timing. Then, take two balls in each hand, and do the exact same set of throws as above, except pair the last throw of the previous step with another horizontal pass using the new fourth ball."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/fourballshowerrun.gif"},{"tag":"P","texto":" And that's pretty much all there is to the Four Ball Shower. Just keep adding in high throws paired with horizontal passes and, as you become more comfortable, you will gradually be able to run the pattern for longer periods of time"}]},{"name":"Sprung Cascade","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/sprungcascade.gif","siteswap":"(6x,2x)*","difficult":" 8","preRequisites":"Box, 5551","balls":"3","description":[{"tag":"P","texto":" The Sprung Cascade is a unique four ball trick that is essentially the three ball Cascade with a fourth ball being passed between hands with every throw. The pattern can also be thought of as a Box with the vertical throws being switched to Cascade throws. The Sprung Cascade is an enjoyable yet difficult pattern to juggle, and looks good to spectators."},{"tag":"P","texto":" To learn the Sprung Cascade, it is best to start with an adaptation of the three ball Box. Juggle a standard Box, but then make one of the vertical throws from your dominant hand a high Cascade throw instead. While that ball is in the air, make a second high Cascade throw with your non-dominant hand, passing the remaining ball in your dominant hand to your non-dominant hand, as if juggling the normal Box. Then, as the first ball begin to come back down toward your non-dominant hand, pass the third ball back to your dominant hand, and then catch the first ball. As the second ball is approaching your dominant hand, resume juggling the standard Box by making a vertical throw with your non-dominant hand paired with a horizontal pass from your dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/sprungcascadethree.gif"},{"tag":"P","texto":" Practice this extensively. Once you have it mastered, you are ready to add in the fourth ball. Start with two balls in each hand, and then make one high Cascade throw from each hand, starting with your dominant hand. As the first ball approaches your non-dominant hand, make a third Cascade throw from your dominant hand and pair it with a horizontal pass from your non-dominant hand, clearing space in your non-dominant hand to catch the first Cascade throw. As the second Cascade throw approaches your dominant hand, make a fourth Cascade throw from your non-dominant hand, and then make a horizontal pass from your dominant hand, clearing space to catch the second Cascade throw. Then catch all the balls."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/sprungcascaderun.gif"},{"tag":"P","texto":" This step may take some time to master. It might help to work on just doing the first Cascade/horizontal pass combination, in order to get used to the throws. Only after the first one is mastered should you then try chaining two together."},{"tag":"P","texto":" Once you have the above step mastered, you need only continue making Cascade/horizontal pass combinations and you will be juggling the full Sprung Cascade. While practicing, you should eventually start to get into a rhythm, which will make the trick much easier."},{"tag":"P","texto":""}]},{"name":"Synchronous Fountain","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/synchfountain.gif","siteswap":"(4,4)","difficult":" 7","preRequisites":"Fountain","balls":"3","description":[{"tag":"P","texto":" The Synchronous Fountain is a variation of the standard Fountain pattern where two balls are thrown simultaneously, instead of a staggered&nbsp; timing. The trick itself is slightly harder than the normal Fountain, simply because you are dealing with two balls at once for each throw and each catch. Therefore, it is best for you to already know the regular Fountain before learning this synchronous variation, and this tutorial will assume you do."},{"tag":"P","texto":" There is really only one step to learning the Synchronous Fountain once you know the standard pattern Start with four balls, two in each hand. Then, throw one ball from each hand simultaneously. Once those balls have reached their peak, throw the last two balls up along the same path, and then catch both pairs of balls."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/synchfountainrun.gif"},{"tag":"P","texto":" Practice this extensively. When you feel comfortable, add in a third pair of throws, then a fourth, fifth, and so on. Eventually, you will be able to run the pattern for long periods of time, at which point you will be juggling the Synchronous Fountain."}]},{"name":"Reverse Synchronous Fountain","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/reversesynchfountain.gif","siteswap":"(4,4)","difficult":" 7","preRequisites":"Synchronous Fountain","balls":"3","description":[{"tag":"P","texto":" The Reverse Synchronous Fountain is a variation of the standard Synchronous Fountain in which the balls are thrown toward the center of your body from the outside. Assuming you are already comfortable with the regular Synchronous Fountain, this trick should not be too difficult to learn. However, the fact that balls from each side are being thrown towards each other increases the odds of collision and makes the Reverse Synchronous more tricky to master than the standard pattern."},{"tag":"P","texto":" To learn this trick, start with two balls in each hand. Then, simultaneously throw one ball from each hand toward your body, as if in a reverse Two-in-one. Then, when those balls are at their peaks, throw the last ball from each hand in a similar fashion as the first, catching the first pair of balls and then catching the last pair."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/reversesynchfountainrun.gif"},{"tag":"P","texto":""},{"tag":"P","texto":" Once you can do this consistently, all that's left is to keep adding more throws until you are able to run the Reverse Synchronous Fountain continously."}]},{"name":"Four Ball Takeouts","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/fourballtakeouts.gif","siteswap":"[43]23","difficult":" 5","preRequisites":"Takeouts, Cliff's Confusion (optional)","balls":"3","description":[{"tag":"P","texto":" Four Ball Takeouts is, as it sounds, a four ball version of Takeouts, accomplished by adding a multiplex to the normal 423 pattern. For this reason it might help to already be familiar with tricks like Cliff's Confusion, which share the same style of multiplex throw. Regardless, you should definitely have regular Takeouts mastered before attempting this version."},{"tag":"P","texto":" To begin learning Four Ball Takeouts, start with one ball in your dominant hand and two balls in your non-dominant. Cross your non-dominant hand under your dominant hand, and then make a short under-the-arm stacked multiplex throw from your non-dominant hand while simultaneously revolving your dominant hand up and over the top multiplexed ball. Catch the bottom multiplexed ball with your dominant hand as it completes its revolution, and then catch the top multiplexed ball with your now empty non-dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/fourballtakeoutsthree.gif"},{"tag":"P","texto":" As shown in the animation above, you will want to get to the point where you can perform this step on each side of your body in rapid succession. To add in the fourth ball, start with two balls in each hand. Make a throw from your dominant hand toward the center of your body, and then cross your non-dominant hand under your dominant hand and make an under-the-arm stacked multiplex, clearing space for your non-dominant hand to catch the ball previously thrown by your dominant hand. As that stacked multiplex throw is being made, swing your dominant hand over and around the top multiplexed ball, catching the bottom multiplexed ball as the hand finishes its revolution. As that catch is being made, make a throw from your non-dominant hand toward the dominant side of your body, clearing space for the hand to catch the top multiplexed ball. The last ball will then also be caught by your non-dominant hand (on the dominant side of your body."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/fourballtakeoutsfull.gif"},{"tag":"P","texto":" Practice this on both sides. To run the full pattern, simply modify the last part of the previous step so that the last ball is caught by your dominant hand after it makes an under-the-arm multiplex throw on the non-dominant side of your body (mirroring the second throw and first catch of the sequence). Four Ball Takeouts is one of the easier four ball tricks, requiring only an hour or two of practice if you are already experienced with regular Takeouts."}]},{"name":"Tennessee Waltz","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/tennesseewaltz.gif","siteswap":"3[32T]","difficult":" 6","preRequisites":"Cascade, Cliff's Confusion (optional)","balls":"3","description":[{"tag":"P","texto":" The Tennessee Waltz is a four ball multiplex pattern reminiscent of Mills Mess. It contains three distinct cycles, each one containing a Cascade/multiplex throw pair but with different arm positions and direction. I found the obscure Tennessee Waltz on a website run by Todd Strong, which contained no information regarding the pattern's popularity or inventor. However, it does bear a similarity to Cliff's Confusion, so the same individual may have had a hand in creating both patterns."},{"tag":"P","texto":" To learn the Tennessee Waltz, it is best to begin with the first cycle, and then add in the next two as you go along. Start with two balls in each hand, and then cross your dominant hand underneath your non-dominant hand (you could cross them in the opposite configuration if you wanted, but you will need to reverse the dominant and non-dominant hands whenever an instruction is given). Make a fairly vertical throw from your dominant hand, and then throw a stacked multiplex from your non-dominant hand while simultaneously uncrossing your arms. You will then catch the lower multiplexed ball with your non-dominant hand, and then reach up and grab the top multiplexed ball with your dominant hand as it begins to come back down."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/tennesseewaltzone.gif"},{"tag":"P","texto":" Practice this until your are comfortable with the two throws. To add in the second cycle, you are going to make a throw from your dominant hand as it reaches up to grab the top multiplexed ball. You will then make an under-the-arm stacked multiplex from your non-dominant hand, clearing space for the ball just thrown from your dominant hand to be caught. You will then catch the bottom multiplexed ball with your non-dominant hand, and then reach over and grab the top multiplexed ball with your dominant hand (just as you did for the previous cycle)."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/tennesseewaltztwo.gif"},{"tag":"P","texto":" Again, practice these throws until you can do them consistently. To add in the third and final cycle, you are going to make a throw back across your body from your dominant hand while it is crossed over your non-dominant hand. You will then catch the top multiplexed ball with your empty dominant hand, which should be uncrossing. As the ball just thrown from your dominant hand approaches your non-dominant hand, you will make a stacked multiplex from your non-dominant hand, clearing space for the ball to be caught. You will catch the bottom multiplexed ball with your non-dominant hand, and then cross your dominant hand underneath your non-dominant to catch the top multiplexed ball."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/tennesseewaltzthree.gif"},{"tag":"P","texto":" Practice all three of the cycles extensively. To begin a new set of cycles, you simply need to make an under-the-arm throw from your dominant hand before it catches the top multiplexed ball from the third cycle. This will set you up to make a multiplex from your non-dominant hand identical to the one thrown in the first cycle. The Tennessee Waltz is not a particularly difficult pattern, but it will take some practice to perfect the multiplexes."}]},{"name":"Tsunami","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/tsunami.gif","siteswap":"72416","difficult":" 7","preRequisites":"Four Ball Mills Mess (optional)","balls":"3","description":[{"tag":"P","texto":" Tsunami is an advanced four ball pattern established byDaniel Marden. It is a shape distortion of the 72416 siteswap, a pattern rarely juggled in its standard form and not relevant to this tutorial. Though bearing some resemblance to Mills Mess, Tsunami is an all together unique trick with no closely related patterns or important prerequisites beyond basic familiarity with four ball juggling."},{"tag":"P","texto":" To begin learning Tsunami, start with one ball in each hand. Make a fairly high throw from your non-dominant hand toward the center of your body, and then cross your dominant hand under your non-dominant arm and make a significantly higher throw from your dominant hand toward the center of your body. Catch both balls in your non-dominant hand. making sure that there is a reasonable amount of time between the catches."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/tsunamitwo.gif"},{"tag":"P","texto":" As shown, practice this on both sides. To add in the third and fourth balls, start with two balls in each hand. Perform the same two throws learned in step one and then, with one ball in each hand, you are going to make a small throw from your dominant hand toward the center of your body, followed closely by a horizontal pass from your non-dominant hand to your now empty dominant hand. The horizontal pass should be timed such that the very first ball thrown by your non-dominant hand is caught right after the pass is made. Your dominant hand will then catch the ball it just threw, while your non-dominant hand catches the underarm ball thrown from your dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/tsunamifour.gif"},{"tag":"P","texto":" As always, practice this on both sides. You have just completed one full cycle of Tsunami; the next step will focus on connecting two of these cycles together. Start by repeating the same throws performed in the previous step. However, before catching the small throw made by your dominant hand (the throw made just before the horizontal pass), you are going to make a high throw from your dominant hand toward the center of your body. This throw is a mirror image of the very first throw made by your non-dominant hand. You will then catch the small throw with your now empty dominant hand. As the high underarm throw made by your dominant hand descends you are going to perform a mirror image of that underarm throw using your non-dominant hand. You will then catch the previous underarm ball with your non-dominant hand, while the other two balls will be caught by your dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/tsunamifull.gif"},{"tag":"P","texto":" Once again, practice this on both sides. Notice that these two additional throws are the beginning of a new cycle. To continue the pattern simply make a small throw and horizontal pass and then follow that up with more cycles. While not being an especially hard pattern to learn, Tsunami is very difficult to master, with tricky timing and a need for accurate throws."}]},{"name":"Wimpy","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/wimpy.gif","siteswap":"(4x,4x)","difficult":" 5","preRequisites":"Cascade","balls":"3","description":[{"tag":"P","texto":" The Wimpy pattern is a synchronous four ball trick in which the balls are simultaneously thrown between hands, such that they would, theoretically, overlap in the middle. To avoid collisions when actually running the pattern, the balls are generally thrown at slightly different heights, so that one hand always throws its ball slightly higher than the other."},{"tag":"P","texto":" To learn the Wimpy pattern, it is best to start with one ball in each hand. Then, simultaneously throw the two balls along a Cascade like path to the other hand, making sure to throw one slightly higher to avoid collisions."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/wimpytwo.gif"},{"tag":"P","texto":" This is pretty much the only intermediate step to learning the Wimpy. After you have the two throws above mastered, just start with two balls in each hand and make a second set of throws after the first set are past their peak. The Wimpy pattern with any number of balls is generally easier than the corresponding fountain pattern, so learning the Wimpy with four balls should not be too difficult."}]},{"name":"Four Ball Windmill","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/fourballwindmill.gif","siteswap":"4","difficult":" 7","preRequisites":"Windmill, Fountain, Four Ball Mills Mess (optional)","balls":"3","description":[{"tag":"P","texto":" The Four Ball Windmill is a four ball variation of the normally three ball Windmill. However, unlike its smaller counterpart, the balls in the Four Ball Windmill never actually switch hands, so the pattern can in fact be seen as an incredibly distorted Fountain. Due to the crossed-arm nature of the trick, the Four Ball Fountain can also be thought of as a variation of the Four Ball Mills Mess, however learning that pattern beforehand is not necessary, though it certainly will help."},{"tag":"P","texto":" To learn the Four Ball Windmill, start with two balls in each hand. Then, make a fairly high throw from your dominant hand toward the center of your body. Quickly follow that up with an under-the-arm throw from your non-dominant hand in the same direction. At this point the first ball should be coming back down, so you are going to make another throw toward the center of your body from the same position as the first throw, clearing space for you to catch the first ball. You are then going to make a second under-the-arm throw from your non-dominant hand and catch the second ball. Then catch the third and fourth balls with your dominant and non-dominant hands respectively."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/fourballwindmillfour.gif"},{"tag":"P","texto":" Practice this until you are able to perform all four throws and catches smoothly and consistently. Then, all that's left to run the full Four Ball Windmill is to make another throw from your dominant hand before catching the third ball, along with another under-the-arm throw from your non-dominant hand before catching the fourth ball. Just repeat this cycle of alternating throws and you will be juggling the Four ball Windmill"}]},{"name":"534","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/534.gif","siteswap":"534","difficult":" 7","preRequisites":"531, Fountain","balls":"3","description":[{"tag":"P","texto":" The 534 is a four ball siteswap pattern which combines three different throws (a high Cascade throw, a low Cascade throw, and a Fountain throw) to bring a more dynamic twist to the standard tower siteswaps (531, 7531, etc.)"},{"tag":"P","texto":" To learn the 534, start with two balls in your dominant hand and one ball in your non-dominant. Make a high Cascade throw from your dominant hand, and then immediately follow it up with a low Cascade throw from your non-dominant hand (as if juggling the first two throws of the 531). As that low Cascade throw is in the air, make a vertical throw from your dominant hand, clearing space for you to catch that low throw. Then catch the first throw with your non-dominant hand (it is important to make sure that this high throw is caught <em>after</em> the low second throw is caught). Finally, catch the vertical throw with your dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/534three.gif"},{"tag":"P","texto":" Practice this extensively on both sides. To add in the fourth ball, you are going to make another high Cascade throw from your non-dominant hand after you make the vertical throw from your dominant hand. This will clear space for you to catch the first high Cascade throw, which was thrown at the very beginning from your dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/534four.gif"},{"tag":"P","texto":" As shown, practice this on both sides. As you may have noticed, the last throw shown in the animation above is a mirror image of the first throw you made. This means that the cycle simply repeats again, this time using the opposite hands for each throw. To run the full 534, just keep repeating the cycle. This is however easier said than done, since the 534 requires precise timing that will take many days if not weeks of practice to master"}]},{"name":"552","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/552.gif","siteswap":"552","difficult":" 4","preRequisites":"Cascade, Snake","balls":"3","description":[{"tag":"P","texto":" The 552 is a four ball pattern in which each hand makes an uninterrupted pair of Cascade-like throws. This gives the pattern an odd asymmetrical-yet-symmetrical feel which separates it from other four ball tricks. The 552 can also be thought of as two two-ball Snakes crossing paths with each other, therefore it is best that you already know the three ball Snake before trying this pattern."},{"tag":"P","texto":" To begin learning the 552, start with two balls in your dominant hand and one ball in your non-dominant. Throw the ball in your non-dominant hand across your body, and then make two sequential throws from your dominant hand to your non-dominant hand, clearing space for your dominant hand to catch the first ball. Then catch the other two balls in your non-dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/552three.gif"},{"tag":"P","texto":" Practice this on both sides. As you may have noticed, this is really just a portion of the three ball Snake. However, it is also the foundation of the 552. Once you have this step mastered, you are ready to add in the fourth ball. Start with two balls in each hand, then make one throw from your non-dominant hand, followed by two throws from your dominant hand (just as in the previous step). As the first ball from your dominant hand approaches your non-dominant hand, throw the ball the latter hand is holding, clearing space for the other ball to land. Once that ball has been caught, throw it back across your body, making room for the second ball from your dominant hand to be caught. Then catch the rest of the balls."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/552run.gif"},{"tag":"P","texto":" Practice this on both sides. Once you have it mastered, all that's left to run the full 552 is to make another two throws with your dominant hand after the last throw in the step above, starting another cycle. This pattern is enjoyable to juggle in its own right, but is also a great warm up to the Five Ball Cascade"}]},{"name":"5551","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/5551.gif","siteswap":"5551","difficult":" 5","preRequisites":"Cascade, Shower","balls":"3","description":[{"tag":"P","texto":" The 5551 is an asymmetric four ball pattern in which three normal Cascade throws are followed by a quick horizontal pass. The speed of this pattern closely matches that of the Five Ball Cascade; as such it is most often learned for the sole purpose of practicing that trick."},{"tag":"P","texto":" To learn the 5551, it is best to start with two balls in each hand. Make a throw from your dominant hand, followed by a throw from your non-dominant hand, then another throw from your dominant hand. This should leave you with three balls in the air, and one ball in your non-dominant hand. Just as the first ball is approaching your non-dominant hand, make a horizontal pass to your dominant hand, and catch the first ball in your non-dominant hand. Then catch the remaining balls."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/5551run.gif"},{"tag":"P","texto":" Once you have this mastered, all that's left to run the full 5551 is to make another Cascade-like throw using the ball that was just passed to your dominant hand, thus repeating the whole cycle over again. Since this trick is asynchronous, you can also learn the 5551 using your dominant hand to make the passes.&nbsp;"}]},{"name":"55550","image":"https://libraryofjuggling.com/JugglingGifs/4balltricks/55550.gif","siteswap":"55550","difficult":" 5","preRequisites":"5551 (optional)","balls":"3","description":[{"tag":"P","texto":" The 55550—also known as Five With a Hole—is a four ball pattern in which all throws are made as if doing a Five Ball Cascade, except one of the balls is simply missing. This creates a short window of time where all the balls are in the air, making the 55550 technically a flash. The trick is somewhat impressive on its own, but is particularly valuable when practicing the Five Ball Cascade."},{"tag":"P","texto":" The learn the 55550, it is best to start with two balls in each hand. Make a Cascade-like throw from your dominant hand, followed by a throw from your non-dominant hand, then your dominant hand again, and finally a last throw from your non-dominant hand. There should be a brief period of time where neither of your hands is holding a ball."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/55550run.gif"},{"tag":"P","texto":" Make sure to pay close attention to the timing of your throws. You want the period of time where all balls are in the air to be as short as possible, in order make the trick appear seamless. Once you have one cycle mastered, all that's left is to keep making the same set of throws repeatedly and you will be running the full 55550"}]},{"name":"Five Ball Cascade","image":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballcascade.gif","siteswap":"5","difficult":" 9","preRequisites":"Cascade, 552, 5551, 55550","balls":"3","description":[{"tag":"P","texto":" The Five Ball Cascade is the base pattern for five ball juggling. It has the same basic structure as the three ball Cascade, with each ball being thrown from one hand to the other in an arch across the body. For most jugglers, the Five Ball Cascade is one of the first patterns encountered that can't simply be learned in a day or two. Instead, it requires months and sometimes even years of practice to become proficient."},{"tag":"P","texto":" For this reason, a step-by-step walthrough is not particularly helpful. Therefore, this tutorial will instead outline important juggling exercises that can be done to accelerate your progress. The first exercise to practice is the <strong>552</strong>.<strong></strong>"},{"tag":"STRONG"},{"tag":"P","texto":"<strong> </strong>While certainly distinct from the Five Ball Cascade, since many throws are made sequentially from the same hand, the 552 is a relatively slow-paced pattern that uses throws of roughly the same height and trajectory as the Five Ball Cascade. This is very important, since your success at mastering that pattern hinges on making accurate throws. Once you have mastered the 552, it is time to move on to the <strong>5551</strong>."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/5551.gif"},{"tag":"P","texto":" The 5551 maintains the same throws as those found in the 552, except for the addition of a horizontal pass. This pass is what gives the 5551 more value for learning the Five Ball Cascade, since the throws are faster and always alternate hands. Once you become comfortable with the 5551, the final exercise to practice is the <strong>55550</strong>."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/4balltricks/55550.gif"},{"tag":"P","texto":" The 55550 is essentially a Five Ball Cascade juggled with only four balls. The only real difference between the two patterns is that the final throw of the Five Ball Cascade is missing. The 55550 forces you to pay close attention to the cadence of your throws, since the gap normally present in the pattern can easily disappear with sloppy timing. Upon mastery of this final exercise, you are ready to add in the fifth ball. "},{"tag":"P","texto":" Start with three balls in your dominant hand and two balls in your non-dominant. Make a high Cascade throw from your dominant hand, and follow it up with two more identical throws, alternating hands each time. At this point, three balls should be in the air, and one ball should be in each hand. The first ball that you threw from your dominant hand should now be approaching your non-dominant hand. Make a throw from your non-dominant hand to clear space for the ball to be caught. Similarly, as the first ball you threw from your non-dominant hand approaches your dominant hand, make a throw from your dominant hand to clear space for that ball to be caught. Then catch the rest of the balls."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballcascadefull.gif"},{"tag":"P","texto":" Practice this step extensively. Once you are able to make and catch all five throws in a controlled manner, you simply need to keep adding more and more throws to the pattern as you become more and more comfortable. Eventually, you will be able to make dozens of throws, at which point it is safe to say that you are a five ball juggler. Of course, there is still a long road ahead to achieving mastery of the Five Ball Cascade, as you begin to make hundreds and then even thousands of throws without dropping"}]},{"name":"Five Ball Reverse Cascade","image":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballreversecascadefull.gif","siteswap":"5","difficult":" 9","preRequisites":"Five Ball Cascade","balls":"3","description":[{"tag":"P","texto":" The Five Ball Reverse Cascade is, as the name suggests, a five ball version of the Reverse Cascade. All of the throws are made on the outside of your body, and all the catches are at the center. This trick, while probably harder to learn from scratch than the regular Five Ball Cascade, is surprisingly easy to pick up if you are already comfortable with five ball juggling. "},{"tag":"P","texto":" For that reason, a step-by-step tutorial is not really helpful. Instead, it is best to just start by juggling the normal Five Ball Cascade, and then switch to overthrows, as if switching between the three ball Cascade and Reverse Cascade. The transition will definitely feel weird at first, but your body should adapt fairly quickly to the new pattern"}]},{"name":"Five Ball Half-Shower","image":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballhalfshower.gif","siteswap":"73, 5, or (6x,4x)","difficult":" 9","preRequisites":"Five Ball Cascade, Four Ball Half-Shower","balls":"3","description":[{"tag":"P","texto":" The Five Ball Half-Shower is basically a Five Ball Cascade where one hand makes constant overthrows, while the other hand makes low throws. This gives the pattern two distinct arches, with the top arch being roughly twice as high as the lower arch."},{"tag":"P","texto":" To learn the Five Ball Half-Shower, I found it easiest to start by juggling a Five Ball Cascade pattern. Then, make an overthrow with your dominant hand, such that the ball travels over all the other balls, and then catch it with your non-dominant hand and resume juggling the Cascade."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballhalfshowerfive.gif"},{"tag":"P","texto":" Practice this one overthrow until you are able to do it consistently and cleanly. After that, the only thing other thing to do is to keep adding overthrows in an ever-growing chain. As you make these overthrows, you will want to also concentrate on lowering the height of your normal throws, as seen in the animation at the top of this page. However, that animation is not intended to be an absolute representation of the Five Ball Half-Shower, since the pattern itself can be juggled using a variety of a heights, and even a variety of siteswaps such as 73, 5, and (6x,4x)"}]},{"name":"Martin","image":"https://libraryofjuggling.com/JugglingGifs/5balltricks/martin.gif","siteswap":"[62]25","difficult":" 6","preRequisites":"The W, Three in One","balls":"3","description":[{"tag":"P","texto":" Martin is a five ball pattern established by Nate Martin. It can be thought of as a variation of the three ball Cascade in which a high vertical toss is made before each crossing throw. This adds some height and complexity to the otherwise simple Cascade, though Martin's difficulty level still remains well below that of most five ball tricks."},{"tag":"P","texto":" To begin learning Martin, start with two balls in your dominant hand and one ball in your non-dominant hand. Make a fairly high crossing throw from your non-dominant hand to your dominant hand and then, as that ball reaches its peak, make a higher vertical throw from your dominant hand. As the first ball approaches your dominant hand you are going to make another high crossing throw, this time from your dominant hand to your non-dominant hand. This will clear space for your dominant hand to catch the first crossing throw. You will then also catch the high vertical ball with your dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/martinthree.gif"},{"tag":"P","texto":" Practice this on both sides. To add in the fourth and fifth ball, start with two balls in your dominant hand and three balls in your non-dominant hand. Make a high crossing throw from your non-dominant hand to your dominant hand, and then follow that up with the same throws and catches you performed in step one. After you make the crossing throw from your dominant hand back to your non-dominant hand you are then going to repeat the same throws and catches of step one, this time using your non-dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/martinfull.gif"},{"tag":"P","texto":" As shown, practice this on both sides. To run the full pattern simply keep repeating cycles of step one on alternating sides of your body. Martin has a fairly unique cadence that makes it interesting to juggle, and spectators will likely be fooled into thinking the trick is harder than it really is.&nbsp;"}]},{"name":"Five Ball Multiplex Columns","image":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballmultiplexcolumns.gif","siteswap":"(4,0)([44],[44])","difficult":" 7","preRequisites":"Columns","balls":"3","description":[{"tag":"P","texto":" Five Ball Multiplex Columns, also called 4 up 1 up, is essentially a three ball Columns pattern with stacked multiplexes made for the outside throws. These simultaneous multiplexes make the trick significantly more difficult to control, particularly when catching them."},{"tag":"P","texto":" To learn the Five Ball Multiplex Columns, it is best to begin by practicing the multiplexes. Start with two balls in each hand, and then make a vertical stacked multiplex from each hand. Then catch the balls using the same hand that threw them."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballmultiplexcolumnsfour.gif"},{"tag":"P","texto":" Practice this step extensively. Once you become comfortable throwing and catching the multiplexes, you are ready to add in the fifth ball. Start with three balls in your dominant hand and two balls in your non-dominant. Make a single vertical throw from your dominant hand at the center of your body, and when that ball reaches its peak and begins to descend, make the two multiplex throws performed in step one, clearing space for you to catch the first ball with your dominant hand. Then catch the rest of the balls."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballmultiplexcolumnsfive.gif"},{"tag":"P","texto":" Once you are able to do one cycle of Five Ball Multiplex Columns, you simply need to make another single vertical throw from the center of your body, and follow it up with another pair of multiplexes. Your pattern will probably be messy at first, with the multiplexes being thrown out of alignment. This will improve as you spend more time practicing the trick"}]},{"name":"Five Ball Shower","image":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballshower.gif","siteswap":"91","difficult":" 9","preRequisites":"Four Ball Shower","balls":"3","description":[{"tag":"P","texto":" The Five Ball Shower is, as it sounds, a five ball version of the Shower pattern. This means that it is juggled higher and faster than the Four Ball Shower (and much higher and faster than the regular Shower), and as such you should already be very comfortable with the Four Ball Shower before attempting the five ball version."},{"tag":"P","texto":" To begin learning the Five Ball Shower it is helpful to first practice juggling the Four Ball Shower at a greater height than usual. This will train you to make more accurate throws, though the timing will be much slower than the full Five Ball Shower."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballshowerfour.gif"},{"tag":"P","texto":" Practice this until your throws feel fairly consistent. To add in the fifth ball, start with three balls in your dominant hand and two balls in your non-dominant hand. Quickly make two very high (the exact height is up to you, but the higher the pattern the slower it will be) crossing throws from your dominant hand and then follow them up with two throw/horizontal pass combinations from your dominant and non-dominant hands respectively. You should make the last horizontal pass from your non-dominant hand just as the first ball thrown from your dominant hand is ready to be caught. As the throws from your dominant hand keep descending you will pass the balls caught by your non-dominant hand back to your dominant hand such that you end up with three balls in your dominant hand and two balls in your non-dominant hand (the same way you started)."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballshowerfive.gif"},{"tag":"P","texto":" You have just performed what is for all intents and purposes a flash of the Five Ball Shower (technically you only made four main catches so it isn't actually a flash). You should practice this until you can make all of the throws at roughly the same height with no collisions. After that you simply need to keep adding in more throws and passes as your skill level increases. The Five Ball Shower is very difficult trick, and it will take you quite a while to master it."}]},{"name":"Five Ball Split Multiplex Cascade","image":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballsplitmultiplexcascade.gif","siteswap":"[32T]","difficult":" 6","preRequisites":"Cascade","balls":"3","description":[{"tag":"P","texto":" The Five Ball Split Multiplex Cascade is essentially a three ball Cascade where every normal throw is paired with a vertical throw that returns to the same hand. This is the split multiplex, which adds a layer of complexity without making the pattern that much harder. As such, the Five Ball Split Multiplex Cascade is probably one of the easiest tricks that can be done with five balls."},{"tag":"P","texto":" To learn the Five Ball Split Multiplex Cascade, start with two balls in each hand. Make a split multiplex from your dominant hand such that one ball travels across your body while the other ball stays roughly in line with your dominant hand. As the ball thrown across your body approaches your non-dominant hand, and as the vertical ball from the multiplex approaches your dominant hand, make a second, identical, multiplex from your non-dominant hand, clearing space for you to catch that first ball. Then catch the rest of the balls."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballsplitmultiplexcascadefour.gif"},{"tag":"P","texto":" As shown, practice this on both sides. While the animations in this tutorial all show the two balls being thrown at different heights, this is a purely stylistic choice, as many jugglers throw both balls at equal heights. Once you can make these two multiplex throws consistently, it is time to add in the fifth ball. Start with three balls in your dominant hand and two balls in your non-dominant. Make a single Cascade throw from your dominant hand, and then make a split multiplex from your non-dominant hand, clearing space for your hand to catch the first ball. As the ball from that multiplex approaches your dominant hand, make a second split multiplex and catch that ball. Then catch the rest of the balls."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballsplitmultiplexcascadefive.gif"},{"tag":"P","texto":" Once you have this first cycle mastered, you simply need to keep making split multiplexes and you will be running the full Five Ball Split Multiplex Cascade"}]},{"name":"Five Ball Stacked Multiplex Cascade","image":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballstackedmultiplexcascade.gif","siteswap":"3[33][33]","difficult":" 7","preRequisites":"Cascade","balls":"3","description":[{"tag":"P","texto":" The Five Ball Stacked Multiplex Cascade is essentially a three ball Cascade where two of the throws in a given cycle are stacked multiplexes. This means that you are throwing two balls at different heights in the same direction. The addition of two balls to what is normally only a three ball pattern makes the Five Ball Stacked Multiplex Cascade a cramped trick in which collisions are common. For that reason, this trick is more difficult than other five ball multiplex patterns such as the Five Ball Split Multiplex Cascade."},{"tag":"P","texto":" To learn the Five Ball Stacked Multiplex Cascade, it is best to begin with the two multiplex throws. Start with two balls in each hand, and then make a stacked multiplex from your dominant hand. As those two balls approach your non-dominant hand, make a second stacked multiplex, this time from your non-dominant hand. This will clear space for you to catch the two balls from the first multiplex. Catch the other two balls in your dominant hand."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballstackedmultiplexcascadefour.gif"},{"tag":"P","texto":" Practice these two throws until you can perform them in a controlled manner. At that point, you are ready to add in the fifth ball. Start with three balls in your dominant hand and two balls in your non-dominant. Make a single normal throw from your dominant hand, and then follow it up with&nbsp; multiplex from your non-dominant hand and then a multiplex from your dominant hand. Catch all the balls after these three throws."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/5balltricks/fiveballstackedmultiplexcascadefive.gif"},{"tag":"P","texto":" Once you have mastered all three of these throws, you simply need to make another single Cascade throw and start the cycle all over again. At that point you will be doing the full Five Ball Stacked Multiplex Cascade"}]},{"name":"Six Ball Fountain","image":"https://libraryofjuggling.com/JugglingGifs/6balltricks/sixballfountain.gif","siteswap":"6","difficult":" 9","preRequisites":"Fountain, Three in One, Five Ball Cascade (optional)","balls":"3","description":[{"tag":"P","texto":" The Six Ball Fountain is, as it sounds, the six ball version of the Fountain. It is the base pattern of six ball juggling, and therefore an important milestone in one's juggling career. Like the Five Ball Cascade, the Six Ball Fountain is very difficult and time consuming to learn, and only with dedicated practice can it be mastered. Given that one does not simply learn the Six Ball Fountain in a day, and seeing as how the pattern is in fact quite simple in principle, this tutorial will only be able to offer basic advice to help you along."},{"tag":"P","texto":" Before attempting the Six Ball Fountain it is very important that you already be fairly comfortable with the Three in One using <strong>both</strong> hands. While outright mastery isn't really necessary, you should at least be able to perform runs of 15-20 catches with good consistency."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/3balltricks/threeinone.gif"},{"tag":"P","texto":" When you first start practicing the Six Ball Fountain it is most helpful to begin with a flash, which means you will throw and catch each ball once. It is important that you take time to really focus on this step as it will provide you with a solid foundation for when you try to add more throws. When performing the flash make sure that the balls are staying on their respective sides and not crossing through the center, and that the timing feels roughly balanced (it's okay if it isn't perfect)."},{"tag":"IMG","texto":"https://libraryofjuggling.com/JugglingGifs/6balltricks/sixballfountainsix.gif"},{"tag":"P","texto":" Once you are comfortable with the flash you can begin to add in more throws. Now this is where different juggling paradigms come into conflict a bit. Some jugglers argue that you should engage in highly structured practice, adding in only one or two throws at a time then purposefully stopping. Others say that you should just try to juggle the pattern for as long as possible, only stopping when you drop a ball. Both of these approaches have some merit, so I personally recommend a compromise method. You should not stop juggling based on a particular number of throws, but instead stop when the pattern becomes unstable. For the Six Ball Fountain this usually means when throws from different hands begin crossing over each other. Not only does this allow you more flexibility but it also allows you to practice collecting all six balls at the end of a run."},{"tag":"P","texto":" Unfortunately there isn't much more to say. The Six Ball Fountain is not a very hard pattern to figure out, but it can be grueling to learn. Progress will likely be slower than for the Five Ball Cascade, but not extremely so—just try to remember that the world of six ball juggling is waiting for you"}]}]